analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixfc_regs.h
/**
 * @file    spixfc_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the SPIXFC Peripheral Module.
 * @note    This file is @generated.
 * @ingroup spixfc_registers
 */

/******************************************************************************
/******************************************************************************
 *
 * Copyright 2023 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_SPIXFC_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_SPIXFC_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     spixfc
 * @defgroup    spixfc_registers SPIXFC_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the SPIXFC Peripheral Module.
 * @details     SPI XiP Flash Configuration Controller
 */

/**
 * @ingroup spixfc_registers
 * Structure type to access the SPIXFC Registers.
 */
typedef struct {
    __IO uint32_t cfg;                  /**< <tt>\b 0x00:</tt> SPIXFC CFG Register */
    __IO uint32_t ss_pol;               /**< <tt>\b 0x04:</tt> SPIXFC SS_POL Register */
    __IO uint32_t gen_ctrl;             /**< <tt>\b 0x08:</tt> SPIXFC GEN_CTRL Register */
    __IO uint32_t fifo_ctrl;            /**< <tt>\b 0x0C:</tt> SPIXFC FIFO_CTRL Register */
    __IO uint32_t sp_ctrl;              /**< <tt>\b 0x10:</tt> SPIXFC SP_CTRL Register */
    __IO uint32_t int_fl;               /**< <tt>\b 0x14:</tt> SPIXFC INT_FL Register */
    __IO uint32_t int_en;               /**< <tt>\b 0x18:</tt> SPIXFC INT_EN Register */
} mxc_spixfc_regs_t;

/* Register offsets for module SPIXFC */
/**
 * @ingroup    spixfc_registers
 * @defgroup   SPIXFC_Register_Offsets Register Offsets
 * @brief      SPIXFC Peripheral Register Offsets from the SPIXFC Base Peripheral Address.
 * @{
 */
#define MXC_R_SPIXFC_CFG                   ((uint32_t)0x00000000UL) /**< Offset from SPIXFC Base Address: <tt> 0x0000</tt> */
#define MXC_R_SPIXFC_SS_POL                ((uint32_t)0x00000004UL) /**< Offset from SPIXFC Base Address: <tt> 0x0004</tt> */
#define MXC_R_SPIXFC_GEN_CTRL              ((uint32_t)0x00000008UL) /**< Offset from SPIXFC Base Address: <tt> 0x0008</tt> */
#define MXC_R_SPIXFC_FIFO_CTRL             ((uint32_t)0x0000000CUL) /**< Offset from SPIXFC Base Address: <tt> 0x000C</tt> */
#define MXC_R_SPIXFC_SP_CTRL               ((uint32_t)0x00000010UL) /**< Offset from SPIXFC Base Address: <tt> 0x0010</tt> */
#define MXC_R_SPIXFC_INT_FL                ((uint32_t)0x00000014UL) /**< Offset from SPIXFC Base Address: <tt> 0x0014</tt> */
#define MXC_R_SPIXFC_INT_EN                ((uint32_t)0x00000018UL) /**< Offset from SPIXFC Base Address: <tt> 0x0018</tt> */
/**@} end of group spixfc_registers */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_CFG SPIXFC_CFG
 * @brief    Configuration Register.
 * @{
 */
#define MXC_F_SPIXFC_CFG_SSEL_POS                      0 /**< CFG_SSEL Position */
#define MXC_F_SPIXFC_CFG_SSEL                          ((uint32_t)(0x7UL << MXC_F_SPIXFC_CFG_SSEL_POS)) /**< CFG_SSEL Mask */
#define MXC_V_SPIXFC_CFG_SSEL_SLAVE0                   ((uint32_t)0x0UL) /**< CFG_SSEL_SLAVE0 Value */
#define MXC_S_SPIXFC_CFG_SSEL_SLAVE0                   (MXC_V_SPIXFC_CFG_SSEL_SLAVE0 << MXC_F_SPIXFC_CFG_SSEL_POS) /**< CFG_SSEL_SLAVE0 Setting */

#define MXC_F_SPIXFC_CFG_MODE_POS                      4 /**< CFG_MODE Position */
#define MXC_F_SPIXFC_CFG_MODE                          ((uint32_t)(0x3UL << MXC_F_SPIXFC_CFG_MODE_POS)) /**< CFG_MODE Mask */
#define MXC_V_SPIXFC_CFG_MODE_MODE0                    ((uint32_t)0x0UL) /**< CFG_MODE_MODE0 Value */
#define MXC_S_SPIXFC_CFG_MODE_MODE0                    (MXC_V_SPIXFC_CFG_MODE_MODE0 << MXC_F_SPIXFC_CFG_MODE_POS) /**< CFG_MODE_MODE0 Setting */
#define MXC_V_SPIXFC_CFG_MODE_MODE3                    ((uint32_t)0x3UL) /**< CFG_MODE_MODE3 Value */
#define MXC_S_SPIXFC_CFG_MODE_MODE3                    (MXC_V_SPIXFC_CFG_MODE_MODE3 << MXC_F_SPIXFC_CFG_MODE_POS) /**< CFG_MODE_MODE3 Setting */

#define MXC_F_SPIXFC_CFG_PGSZ_POS                      6 /**< CFG_PGSZ Position */
#define MXC_F_SPIXFC_CFG_PGSZ                          ((uint32_t)(0x3UL << MXC_F_SPIXFC_CFG_PGSZ_POS)) /**< CFG_PGSZ Mask */
#define MXC_V_SPIXFC_CFG_PGSZ_4BYTES                   ((uint32_t)0x0UL) /**< CFG_PGSZ_4BYTES Value */
#define MXC_S_SPIXFC_CFG_PGSZ_4BYTES                   (MXC_V_SPIXFC_CFG_PGSZ_4BYTES << MXC_F_SPIXFC_CFG_PGSZ_POS) /**< CFG_PGSZ_4BYTES Setting */
#define MXC_V_SPIXFC_CFG_PGSZ_8BYTES                   ((uint32_t)0x1UL) /**< CFG_PGSZ_8BYTES Value */
#define MXC_S_SPIXFC_CFG_PGSZ_8BYTES                   (MXC_V_SPIXFC_CFG_PGSZ_8BYTES << MXC_F_SPIXFC_CFG_PGSZ_POS) /**< CFG_PGSZ_8BYTES Setting */
#define MXC_V_SPIXFC_CFG_PGSZ_16BYTES                  ((uint32_t)0x2UL) /**< CFG_PGSZ_16BYTES Value */
#define MXC_S_SPIXFC_CFG_PGSZ_16BYTES                  (MXC_V_SPIXFC_CFG_PGSZ_16BYTES << MXC_F_SPIXFC_CFG_PGSZ_POS) /**< CFG_PGSZ_16BYTES Setting */
#define MXC_V_SPIXFC_CFG_PGSZ_32BYTES                  ((uint32_t)0x3UL) /**< CFG_PGSZ_32BYTES Value */
#define MXC_S_SPIXFC_CFG_PGSZ_32BYTES                  (MXC_V_SPIXFC_CFG_PGSZ_32BYTES << MXC_F_SPIXFC_CFG_PGSZ_POS) /**< CFG_PGSZ_32BYTES Setting */

#define MXC_F_SPIXFC_CFG_HICLK_POS                     8 /**< CFG_HICLK Position */
#define MXC_F_SPIXFC_CFG_HICLK                         ((uint32_t)(0xFUL << MXC_F_SPIXFC_CFG_HICLK_POS)) /**< CFG_HICLK Mask */
#define MXC_V_SPIXFC_CFG_HICLK_16CLK                   ((uint32_t)0x0UL) /**< CFG_HICLK_16CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_16CLK                   (MXC_V_SPIXFC_CFG_HICLK_16CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_16CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_1CLK                    ((uint32_t)0x1UL) /**< CFG_HICLK_1CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_1CLK                    (MXC_V_SPIXFC_CFG_HICLK_1CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_1CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_2CLK                    ((uint32_t)0x2UL) /**< CFG_HICLK_2CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_2CLK                    (MXC_V_SPIXFC_CFG_HICLK_2CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_2CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_3CLK                    ((uint32_t)0x3UL) /**< CFG_HICLK_3CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_3CLK                    (MXC_V_SPIXFC_CFG_HICLK_3CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_3CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_4CLK                    ((uint32_t)0x4UL) /**< CFG_HICLK_4CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_4CLK                    (MXC_V_SPIXFC_CFG_HICLK_4CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_4CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_5CLK                    ((uint32_t)0x5UL) /**< CFG_HICLK_5CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_5CLK                    (MXC_V_SPIXFC_CFG_HICLK_5CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_5CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_6CLK                    ((uint32_t)0x6UL) /**< CFG_HICLK_6CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_6CLK                    (MXC_V_SPIXFC_CFG_HICLK_6CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_6CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_7CLK                    ((uint32_t)0x7UL) /**< CFG_HICLK_7CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_7CLK                    (MXC_V_SPIXFC_CFG_HICLK_7CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_7CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_8CLK                    ((uint32_t)0x8UL) /**< CFG_HICLK_8CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_8CLK                    (MXC_V_SPIXFC_CFG_HICLK_8CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_8CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_9CLK                    ((uint32_t)0x9UL) /**< CFG_HICLK_9CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_9CLK                    (MXC_V_SPIXFC_CFG_HICLK_9CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_9CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_10CLK                   ((uint32_t)0xAUL) /**< CFG_HICLK_10CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_10CLK                   (MXC_V_SPIXFC_CFG_HICLK_10CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_10CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_11CLK                   ((uint32_t)0xBUL) /**< CFG_HICLK_11CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_11CLK                   (MXC_V_SPIXFC_CFG_HICLK_11CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_11CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_12CLK                   ((uint32_t)0xCUL) /**< CFG_HICLK_12CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_12CLK                   (MXC_V_SPIXFC_CFG_HICLK_12CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_12CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_13CLK                   ((uint32_t)0xDUL) /**< CFG_HICLK_13CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_13CLK                   (MXC_V_SPIXFC_CFG_HICLK_13CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_13CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_14CLK                   ((uint32_t)0xEUL) /**< CFG_HICLK_14CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_14CLK                   (MXC_V_SPIXFC_CFG_HICLK_14CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_14CLK Setting */
#define MXC_V_SPIXFC_CFG_HICLK_15CLK                   ((uint32_t)0xFUL) /**< CFG_HICLK_15CLK Value */
#define MXC_S_SPIXFC_CFG_HICLK_15CLK                   (MXC_V_SPIXFC_CFG_HICLK_15CLK << MXC_F_SPIXFC_CFG_HICLK_POS) /**< CFG_HICLK_15CLK Setting */

