analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixfc_regs.h
#define MXC_F_SPIXFC_CFG_LOCLK_POS                     12 /**< CFG_LOCLK Position */
#define MXC_F_SPIXFC_CFG_LOCLK                         ((uint32_t)(0xFUL << MXC_F_SPIXFC_CFG_LOCLK_POS)) /**< CFG_LOCLK Mask */
#define MXC_V_SPIXFC_CFG_LOCLK_16CLK                   ((uint32_t)0x0UL) /**< CFG_LOCLK_16CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_16CLK                   (MXC_V_SPIXFC_CFG_LOCLK_16CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_16CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_1CLK                    ((uint32_t)0x1UL) /**< CFG_LOCLK_1CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_1CLK                    (MXC_V_SPIXFC_CFG_LOCLK_1CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_1CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_2CLK                    ((uint32_t)0x2UL) /**< CFG_LOCLK_2CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_2CLK                    (MXC_V_SPIXFC_CFG_LOCLK_2CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_2CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_3CLK                    ((uint32_t)0x3UL) /**< CFG_LOCLK_3CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_3CLK                    (MXC_V_SPIXFC_CFG_LOCLK_3CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_3CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_4CLK                    ((uint32_t)0x4UL) /**< CFG_LOCLK_4CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_4CLK                    (MXC_V_SPIXFC_CFG_LOCLK_4CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_4CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_5CLK                    ((uint32_t)0x5UL) /**< CFG_LOCLK_5CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_5CLK                    (MXC_V_SPIXFC_CFG_LOCLK_5CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_5CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_6CLK                    ((uint32_t)0x6UL) /**< CFG_LOCLK_6CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_6CLK                    (MXC_V_SPIXFC_CFG_LOCLK_6CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_6CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_7CLK                    ((uint32_t)0x7UL) /**< CFG_LOCLK_7CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_7CLK                    (MXC_V_SPIXFC_CFG_LOCLK_7CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_7CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_8CLK                    ((uint32_t)0x8UL) /**< CFG_LOCLK_8CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_8CLK                    (MXC_V_SPIXFC_CFG_LOCLK_8CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_8CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_9CLK                    ((uint32_t)0x9UL) /**< CFG_LOCLK_9CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_9CLK                    (MXC_V_SPIXFC_CFG_LOCLK_9CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_9CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_10CLK                   ((uint32_t)0xAUL) /**< CFG_LOCLK_10CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_10CLK                   (MXC_V_SPIXFC_CFG_LOCLK_10CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_10CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_11CLK                   ((uint32_t)0xBUL) /**< CFG_LOCLK_11CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_11CLK                   (MXC_V_SPIXFC_CFG_LOCLK_11CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_11CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_12CLK                   ((uint32_t)0xCUL) /**< CFG_LOCLK_12CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_12CLK                   (MXC_V_SPIXFC_CFG_LOCLK_12CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_12CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_13CLK                   ((uint32_t)0xDUL) /**< CFG_LOCLK_13CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_13CLK                   (MXC_V_SPIXFC_CFG_LOCLK_13CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_13CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_14CLK                   ((uint32_t)0xEUL) /**< CFG_LOCLK_14CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_14CLK                   (MXC_V_SPIXFC_CFG_LOCLK_14CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_14CLK Setting */
#define MXC_V_SPIXFC_CFG_LOCLK_15CLK                   ((uint32_t)0xFUL) /**< CFG_LOCLK_15CLK Value */
#define MXC_S_SPIXFC_CFG_LOCLK_15CLK                   (MXC_V_SPIXFC_CFG_LOCLK_15CLK << MXC_F_SPIXFC_CFG_LOCLK_POS) /**< CFG_LOCLK_15CLK Setting */

#define MXC_F_SPIXFC_CFG_SSACT_POS                     16 /**< CFG_SSACT Position */
#define MXC_F_SPIXFC_CFG_SSACT                         ((uint32_t)(0x3UL << MXC_F_SPIXFC_CFG_SSACT_POS)) /**< CFG_SSACT Mask */
#define MXC_V_SPIXFC_CFG_SSACT_0CLK                    ((uint32_t)0x0UL) /**< CFG_SSACT_0CLK Value */
#define MXC_S_SPIXFC_CFG_SSACT_0CLK                    (MXC_V_SPIXFC_CFG_SSACT_0CLK << MXC_F_SPIXFC_CFG_SSACT_POS) /**< CFG_SSACT_0CLK Setting */
#define MXC_V_SPIXFC_CFG_SSACT_2CLK                    ((uint32_t)0x1UL) /**< CFG_SSACT_2CLK Value */
#define MXC_S_SPIXFC_CFG_SSACT_2CLK                    (MXC_V_SPIXFC_CFG_SSACT_2CLK << MXC_F_SPIXFC_CFG_SSACT_POS) /**< CFG_SSACT_2CLK Setting */
#define MXC_V_SPIXFC_CFG_SSACT_4CLK                    ((uint32_t)0x2UL) /**< CFG_SSACT_4CLK Value */
#define MXC_S_SPIXFC_CFG_SSACT_4CLK                    (MXC_V_SPIXFC_CFG_SSACT_4CLK << MXC_F_SPIXFC_CFG_SSACT_POS) /**< CFG_SSACT_4CLK Setting */
#define MXC_V_SPIXFC_CFG_SSACT_8CLK                    ((uint32_t)0x3UL) /**< CFG_SSACT_8CLK Value */
#define MXC_S_SPIXFC_CFG_SSACT_8CLK                    (MXC_V_SPIXFC_CFG_SSACT_8CLK << MXC_F_SPIXFC_CFG_SSACT_POS) /**< CFG_SSACT_8CLK Setting */

#define MXC_F_SPIXFC_CFG_INACT_POS                     18 /**< CFG_INACT Position */
#define MXC_F_SPIXFC_CFG_INACT                         ((uint32_t)(0x3UL << MXC_F_SPIXFC_CFG_INACT_POS)) /**< CFG_INACT Mask */
#define MXC_V_SPIXFC_CFG_INACT_4CLK                    ((uint32_t)0x0UL) /**< CFG_INACT_4CLK Value */
#define MXC_S_SPIXFC_CFG_INACT_4CLK                    (MXC_V_SPIXFC_CFG_INACT_4CLK << MXC_F_SPIXFC_CFG_INACT_POS) /**< CFG_INACT_4CLK Setting */
#define MXC_V_SPIXFC_CFG_INACT_6CLK                    ((uint32_t)0x1UL) /**< CFG_INACT_6CLK Value */
#define MXC_S_SPIXFC_CFG_INACT_6CLK                    (MXC_V_SPIXFC_CFG_INACT_6CLK << MXC_F_SPIXFC_CFG_INACT_POS) /**< CFG_INACT_6CLK Setting */
#define MXC_V_SPIXFC_CFG_INACT_8CLK                    ((uint32_t)0x2UL) /**< CFG_INACT_8CLK Value */
#define MXC_S_SPIXFC_CFG_INACT_8CLK                    (MXC_V_SPIXFC_CFG_INACT_8CLK << MXC_F_SPIXFC_CFG_INACT_POS) /**< CFG_INACT_8CLK Setting */
#define MXC_V_SPIXFC_CFG_INACT_12CLK                   ((uint32_t)0x3UL) /**< CFG_INACT_12CLK Value */
#define MXC_S_SPIXFC_CFG_INACT_12CLK                   (MXC_V_SPIXFC_CFG_INACT_12CLK << MXC_F_SPIXFC_CFG_INACT_POS) /**< CFG_INACT_12CLK Setting */

#define MXC_F_SPIXFC_CFG_IOSMPL_POS                    20 /**< CFG_IOSMPL Position */
#define MXC_F_SPIXFC_CFG_IOSMPL                        ((uint32_t)(0xFUL << MXC_F_SPIXFC_CFG_IOSMPL_POS)) /**< CFG_IOSMPL Mask */
#define MXC_V_SPIXFC_CFG_IOSMPL_NODLY                  ((uint32_t)0x0UL) /**< CFG_IOSMPL_NODLY Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_NODLY                  (MXC_V_SPIXFC_CFG_IOSMPL_NODLY << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_NODLY Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_1CLK                   ((uint32_t)0x1UL) /**< CFG_IOSMPL_1CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_1CLK                   (MXC_V_SPIXFC_CFG_IOSMPL_1CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_1CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_2CLK                   ((uint32_t)0x2UL) /**< CFG_IOSMPL_2CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_2CLK                   (MXC_V_SPIXFC_CFG_IOSMPL_2CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_2CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_3CLK                   ((uint32_t)0x3UL) /**< CFG_IOSMPL_3CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_3CLK                   (MXC_V_SPIXFC_CFG_IOSMPL_3CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_3CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_4CLK                   ((uint32_t)0x4UL) /**< CFG_IOSMPL_4CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_4CLK                   (MXC_V_SPIXFC_CFG_IOSMPL_4CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_4CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_5CLK                   ((uint32_t)0x5UL) /**< CFG_IOSMPL_5CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_5CLK                   (MXC_V_SPIXFC_CFG_IOSMPL_5CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_5CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_6CLK                   ((uint32_t)0x6UL) /**< CFG_IOSMPL_6CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_6CLK                   (MXC_V_SPIXFC_CFG_IOSMPL_6CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_6CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_7CLK                   ((uint32_t)0x7UL) /**< CFG_IOSMPL_7CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_7CLK                   (MXC_V_SPIXFC_CFG_IOSMPL_7CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_7CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_8CLK                   ((uint32_t)0x8UL) /**< CFG_IOSMPL_8CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_8CLK                   (MXC_V_SPIXFC_CFG_IOSMPL_8CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_8CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_9CLK                   ((uint32_t)0x9UL) /**< CFG_IOSMPL_9CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_9CLK                   (MXC_V_SPIXFC_CFG_IOSMPL_9CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_9CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_10CLK                  ((uint32_t)0xAUL) /**< CFG_IOSMPL_10CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_10CLK                  (MXC_V_SPIXFC_CFG_IOSMPL_10CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_10CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_11CLK                  ((uint32_t)0xBUL) /**< CFG_IOSMPL_11CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_11CLK                  (MXC_V_SPIXFC_CFG_IOSMPL_11CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_11CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_12CLK                  ((uint32_t)0xCUL) /**< CFG_IOSMPL_12CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_12CLK                  (MXC_V_SPIXFC_CFG_IOSMPL_12CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_12CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_13CLK                  ((uint32_t)0xDUL) /**< CFG_IOSMPL_13CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_13CLK                  (MXC_V_SPIXFC_CFG_IOSMPL_13CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_13CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_14CLK                  ((uint32_t)0xEUL) /**< CFG_IOSMPL_14CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_14CLK                  (MXC_V_SPIXFC_CFG_IOSMPL_14CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_14CLK Setting */
#define MXC_V_SPIXFC_CFG_IOSMPL_15CLK                  ((uint32_t)0xFUL) /**< CFG_IOSMPL_15CLK Value */
#define MXC_S_SPIXFC_CFG_IOSMPL_15CLK                  (MXC_V_SPIXFC_CFG_IOSMPL_15CLK << MXC_F_SPIXFC_CFG_IOSMPL_POS) /**< CFG_IOSMPL_15CLK Setting */

