analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixfc_regs.h
/**@} end of group SPIXFC_CFG_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_SS_POL SPIXFC_SS_POL
 * @brief    SPIX Controller Slave Select Polarity Register.
 * @{
 */
#define MXC_F_SPIXFC_SS_POL_SSPOL_0_POS                0 /**< SS_POL_SSPOL_0 Position */
#define MXC_F_SPIXFC_SS_POL_SSPOL_0                    ((uint32_t)(0x1UL << MXC_F_SPIXFC_SS_POL_SSPOL_0_POS)) /**< SS_POL_SSPOL_0 Mask */
#define MXC_V_SPIXFC_SS_POL_SSPOL_0_ACTIVELO           ((uint32_t)0x0UL) /**< SS_POL_SSPOL_0_ACTIVELO Value */
#define MXC_S_SPIXFC_SS_POL_SSPOL_0_ACTIVELO           (MXC_V_SPIXFC_SS_POL_SSPOL_0_ACTIVELO << MXC_F_SPIXFC_SS_POL_SSPOL_0_POS) /**< SS_POL_SSPOL_0_ACTIVELO Setting */
#define MXC_V_SPIXFC_SS_POL_SSPOL_0_ACTIVEHI           ((uint32_t)0x1UL) /**< SS_POL_SSPOL_0_ACTIVEHI Value */
#define MXC_S_SPIXFC_SS_POL_SSPOL_0_ACTIVEHI           (MXC_V_SPIXFC_SS_POL_SSPOL_0_ACTIVEHI << MXC_F_SPIXFC_SS_POL_SSPOL_0_POS) /**< SS_POL_SSPOL_0_ACTIVEHI Setting */

/**@} end of group SPIXFC_SS_POL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_GEN_CTRL SPIXFC_GEN_CTRL
 * @brief    SPIX Controller General Controller Register.
 * @{
 */
#define MXC_F_SPIXFC_GEN_CTRL_ENABLE_POS               0 /**< GEN_CTRL_ENABLE Position */
#define MXC_F_SPIXFC_GEN_CTRL_ENABLE                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_ENABLE_POS)) /**< GEN_CTRL_ENABLE Mask */
#define MXC_V_SPIXFC_GEN_CTRL_ENABLE_DIS               ((uint32_t)0x0UL) /**< GEN_CTRL_ENABLE_DIS Value */
#define MXC_S_SPIXFC_GEN_CTRL_ENABLE_DIS               (MXC_V_SPIXFC_GEN_CTRL_ENABLE_DIS << MXC_F_SPIXFC_GEN_CTRL_ENABLE_POS) /**< GEN_CTRL_ENABLE_DIS Setting */
#define MXC_V_SPIXFC_GEN_CTRL_ENABLE_EN                ((uint32_t)0x1UL) /**< GEN_CTRL_ENABLE_EN Value */
#define MXC_S_SPIXFC_GEN_CTRL_ENABLE_EN                (MXC_V_SPIXFC_GEN_CTRL_ENABLE_EN << MXC_F_SPIXFC_GEN_CTRL_ENABLE_POS) /**< GEN_CTRL_ENABLE_EN Setting */

#define MXC_F_SPIXFC_GEN_CTRL_TFIFOEN_POS              1 /**< GEN_CTRL_TFIFOEN Position */
#define MXC_F_SPIXFC_GEN_CTRL_TFIFOEN                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_TFIFOEN_POS)) /**< GEN_CTRL_TFIFOEN Mask */
#define MXC_V_SPIXFC_GEN_CTRL_TFIFOEN_DIS              ((uint32_t)0x0UL) /**< GEN_CTRL_TFIFOEN_DIS Value */
#define MXC_S_SPIXFC_GEN_CTRL_TFIFOEN_DIS              (MXC_V_SPIXFC_GEN_CTRL_TFIFOEN_DIS << MXC_F_SPIXFC_GEN_CTRL_TFIFOEN_POS) /**< GEN_CTRL_TFIFOEN_DIS Setting */
#define MXC_V_SPIXFC_GEN_CTRL_TFIFOEN_EN               ((uint32_t)0x1UL) /**< GEN_CTRL_TFIFOEN_EN Value */
#define MXC_S_SPIXFC_GEN_CTRL_TFIFOEN_EN               (MXC_V_SPIXFC_GEN_CTRL_TFIFOEN_EN << MXC_F_SPIXFC_GEN_CTRL_TFIFOEN_POS) /**< GEN_CTRL_TFIFOEN_EN Setting */

#define MXC_F_SPIXFC_GEN_CTRL_RFIFOEN_POS              2 /**< GEN_CTRL_RFIFOEN Position */
#define MXC_F_SPIXFC_GEN_CTRL_RFIFOEN                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_RFIFOEN_POS)) /**< GEN_CTRL_RFIFOEN Mask */
#define MXC_V_SPIXFC_GEN_CTRL_RFIFOEN_DIS              ((uint32_t)0x0UL) /**< GEN_CTRL_RFIFOEN_DIS Value */
#define MXC_S_SPIXFC_GEN_CTRL_RFIFOEN_DIS              (MXC_V_SPIXFC_GEN_CTRL_RFIFOEN_DIS << MXC_F_SPIXFC_GEN_CTRL_RFIFOEN_POS) /**< GEN_CTRL_RFIFOEN_DIS Setting */
#define MXC_V_SPIXFC_GEN_CTRL_RFIFOEN_EN               ((uint32_t)0x1UL) /**< GEN_CTRL_RFIFOEN_EN Value */
#define MXC_S_SPIXFC_GEN_CTRL_RFIFOEN_EN               (MXC_V_SPIXFC_GEN_CTRL_RFIFOEN_EN << MXC_F_SPIXFC_GEN_CTRL_RFIFOEN_POS) /**< GEN_CTRL_RFIFOEN_EN Setting */

#define MXC_F_SPIXFC_GEN_CTRL_BBMODE_POS               3 /**< GEN_CTRL_BBMODE Position */
#define MXC_F_SPIXFC_GEN_CTRL_BBMODE                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_BBMODE_POS)) /**< GEN_CTRL_BBMODE Mask */
#define MXC_V_SPIXFC_GEN_CTRL_BBMODE_DIS               ((uint32_t)0x0UL) /**< GEN_CTRL_BBMODE_DIS Value */
#define MXC_S_SPIXFC_GEN_CTRL_BBMODE_DIS               (MXC_V_SPIXFC_GEN_CTRL_BBMODE_DIS << MXC_F_SPIXFC_GEN_CTRL_BBMODE_POS) /**< GEN_CTRL_BBMODE_DIS Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BBMODE_EN                ((uint32_t)0x1UL) /**< GEN_CTRL_BBMODE_EN Value */
#define MXC_S_SPIXFC_GEN_CTRL_BBMODE_EN                (MXC_V_SPIXFC_GEN_CTRL_BBMODE_EN << MXC_F_SPIXFC_GEN_CTRL_BBMODE_POS) /**< GEN_CTRL_BBMODE_EN Setting */

#define MXC_F_SPIXFC_GEN_CTRL_SSDR_POS                 4 /**< GEN_CTRL_SSDR Position */
#define MXC_F_SPIXFC_GEN_CTRL_SSDR                     ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SSDR_POS)) /**< GEN_CTRL_SSDR Mask */
#define MXC_V_SPIXFC_GEN_CTRL_SSDR_OUTPUT0             ((uint32_t)0x0UL) /**< GEN_CTRL_SSDR_OUTPUT0 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SSDR_OUTPUT0             (MXC_V_SPIXFC_GEN_CTRL_SSDR_OUTPUT0 << MXC_F_SPIXFC_GEN_CTRL_SSDR_POS) /**< GEN_CTRL_SSDR_OUTPUT0 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_SSDR_OUTPUT1             ((uint32_t)0x1UL) /**< GEN_CTRL_SSDR_OUTPUT1 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SSDR_OUTPUT1             (MXC_V_SPIXFC_GEN_CTRL_SSDR_OUTPUT1 << MXC_F_SPIXFC_GEN_CTRL_SSDR_POS) /**< GEN_CTRL_SSDR_OUTPUT1 Setting */

#define MXC_F_SPIXFC_GEN_CTRL_SCKDR_POS                6 /**< GEN_CTRL_SCKDR Position */
#define MXC_F_SPIXFC_GEN_CTRL_SCKDR                    ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SCKDR_POS)) /**< GEN_CTRL_SCKDR Mask */
#define MXC_V_SPIXFC_GEN_CTRL_SCKDR_SCK0               ((uint32_t)0x0UL) /**< GEN_CTRL_SCKDR_SCK0 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SCKDR_SCK0               (MXC_V_SPIXFC_GEN_CTRL_SCKDR_SCK0 << MXC_F_SPIXFC_GEN_CTRL_SCKDR_POS) /**< GEN_CTRL_SCKDR_SCK0 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_SCKDR_SCK1               ((uint32_t)0x1UL) /**< GEN_CTRL_SCKDR_SCK1 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SCKDR_SCK1               (MXC_V_SPIXFC_GEN_CTRL_SCKDR_SCK1 << MXC_F_SPIXFC_GEN_CTRL_SCKDR_POS) /**< GEN_CTRL_SCKDR_SCK1 Setting */

#define MXC_F_SPIXFC_GEN_CTRL_SDATAIN_POS              8 /**< GEN_CTRL_SDATAIN Position */
#define MXC_F_SPIXFC_GEN_CTRL_SDATAIN                  ((uint32_t)(0xFUL << MXC_F_SPIXFC_GEN_CTRL_SDATAIN_POS)) /**< GEN_CTRL_SDATAIN Mask */
#define MXC_V_SPIXFC_GEN_CTRL_SDATAIN_SDIO0            ((uint32_t)0x1UL) /**< GEN_CTRL_SDATAIN_SDIO0 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SDATAIN_SDIO0            (MXC_V_SPIXFC_GEN_CTRL_SDATAIN_SDIO0 << MXC_F_SPIXFC_GEN_CTRL_SDATAIN_POS) /**< GEN_CTRL_SDATAIN_SDIO0 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_SDATAIN_SDIO1            ((uint32_t)0x2UL) /**< GEN_CTRL_SDATAIN_SDIO1 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SDATAIN_SDIO1            (MXC_V_SPIXFC_GEN_CTRL_SDATAIN_SDIO1 << MXC_F_SPIXFC_GEN_CTRL_SDATAIN_POS) /**< GEN_CTRL_SDATAIN_SDIO1 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_SDATAIN_SDIO2            ((uint32_t)0x4UL) /**< GEN_CTRL_SDATAIN_SDIO2 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SDATAIN_SDIO2            (MXC_V_SPIXFC_GEN_CTRL_SDATAIN_SDIO2 << MXC_F_SPIXFC_GEN_CTRL_SDATAIN_POS) /**< GEN_CTRL_SDATAIN_SDIO2 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_SDATAIN_SDIO3            ((uint32_t)0x8UL) /**< GEN_CTRL_SDATAIN_SDIO3 Value */
#define MXC_S_SPIXFC_GEN_CTRL_SDATAIN_SDIO3            (MXC_V_SPIXFC_GEN_CTRL_SDATAIN_SDIO3 << MXC_F_SPIXFC_GEN_CTRL_SDATAIN_POS) /**< GEN_CTRL_SDATAIN_SDIO3 Setting */

