analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixfc_regs.h
#define MXC_F_SPIXFC_GEN_CTRL_BBDAT_POS                12 /**< GEN_CTRL_BBDAT Position */
#define MXC_F_SPIXFC_GEN_CTRL_BBDAT                    ((uint32_t)(0xFUL << MXC_F_SPIXFC_GEN_CTRL_BBDAT_POS)) /**< GEN_CTRL_BBDAT Mask */
#define MXC_V_SPIXFC_GEN_CTRL_BBDAT_SDIO0              ((uint32_t)0x1UL) /**< GEN_CTRL_BBDAT_SDIO0 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BBDAT_SDIO0              (MXC_V_SPIXFC_GEN_CTRL_BBDAT_SDIO0 << MXC_F_SPIXFC_GEN_CTRL_BBDAT_POS) /**< GEN_CTRL_BBDAT_SDIO0 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BBDAT_SDIO1              ((uint32_t)0x2UL) /**< GEN_CTRL_BBDAT_SDIO1 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BBDAT_SDIO1              (MXC_V_SPIXFC_GEN_CTRL_BBDAT_SDIO1 << MXC_F_SPIXFC_GEN_CTRL_BBDAT_POS) /**< GEN_CTRL_BBDAT_SDIO1 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BBDAT_SDIO2              ((uint32_t)0x4UL) /**< GEN_CTRL_BBDAT_SDIO2 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BBDAT_SDIO2              (MXC_V_SPIXFC_GEN_CTRL_BBDAT_SDIO2 << MXC_F_SPIXFC_GEN_CTRL_BBDAT_POS) /**< GEN_CTRL_BBDAT_SDIO2 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BBDAT_SDIO3              ((uint32_t)0x8UL) /**< GEN_CTRL_BBDAT_SDIO3 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BBDAT_SDIO3              (MXC_V_SPIXFC_GEN_CTRL_BBDAT_SDIO3 << MXC_F_SPIXFC_GEN_CTRL_BBDAT_POS) /**< GEN_CTRL_BBDAT_SDIO3 Setting */

#define MXC_F_SPIXFC_GEN_CTRL_BBDATOEN_POS             16 /**< GEN_CTRL_BBDATOEN Position */
#define MXC_F_SPIXFC_GEN_CTRL_BBDATOEN                 ((uint32_t)(0xFUL << MXC_F_SPIXFC_GEN_CTRL_BBDATOEN_POS)) /**< GEN_CTRL_BBDATOEN Mask */
#define MXC_V_SPIXFC_GEN_CTRL_BBDATOEN_SDIO0           ((uint32_t)0x1UL) /**< GEN_CTRL_BBDATOEN_SDIO0 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BBDATOEN_SDIO0           (MXC_V_SPIXFC_GEN_CTRL_BBDATOEN_SDIO0 << MXC_F_SPIXFC_GEN_CTRL_BBDATOEN_POS) /**< GEN_CTRL_BBDATOEN_SDIO0 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BBDATOEN_SDIO1           ((uint32_t)0x2UL) /**< GEN_CTRL_BBDATOEN_SDIO1 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BBDATOEN_SDIO1           (MXC_V_SPIXFC_GEN_CTRL_BBDATOEN_SDIO1 << MXC_F_SPIXFC_GEN_CTRL_BBDATOEN_POS) /**< GEN_CTRL_BBDATOEN_SDIO1 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BBDATOEN_SDIO2           ((uint32_t)0x4UL) /**< GEN_CTRL_BBDATOEN_SDIO2 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BBDATOEN_SDIO2           (MXC_V_SPIXFC_GEN_CTRL_BBDATOEN_SDIO2 << MXC_F_SPIXFC_GEN_CTRL_BBDATOEN_POS) /**< GEN_CTRL_BBDATOEN_SDIO2 Setting */
#define MXC_V_SPIXFC_GEN_CTRL_BBDATOEN_SDIO3           ((uint32_t)0x8UL) /**< GEN_CTRL_BBDATOEN_SDIO3 Value */
#define MXC_S_SPIXFC_GEN_CTRL_BBDATOEN_SDIO3           (MXC_V_SPIXFC_GEN_CTRL_BBDATOEN_SDIO3 << MXC_F_SPIXFC_GEN_CTRL_BBDATOEN_POS) /**< GEN_CTRL_BBDATOEN_SDIO3 Setting */

#define MXC_F_SPIXFC_GEN_CTRL_SIMPLE_POS               20 /**< GEN_CTRL_SIMPLE Position */
#define MXC_F_SPIXFC_GEN_CTRL_SIMPLE                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SIMPLE_POS)) /**< GEN_CTRL_SIMPLE Mask */
#define MXC_V_SPIXFC_GEN_CTRL_SIMPLE_DIS               ((uint32_t)0x0UL) /**< GEN_CTRL_SIMPLE_DIS Value */
#define MXC_S_SPIXFC_GEN_CTRL_SIMPLE_DIS               (MXC_V_SPIXFC_GEN_CTRL_SIMPLE_DIS << MXC_F_SPIXFC_GEN_CTRL_SIMPLE_POS) /**< GEN_CTRL_SIMPLE_DIS Setting */
#define MXC_V_SPIXFC_GEN_CTRL_SIMPLE_EN                ((uint32_t)0x1UL) /**< GEN_CTRL_SIMPLE_EN Value */
#define MXC_S_SPIXFC_GEN_CTRL_SIMPLE_EN                (MXC_V_SPIXFC_GEN_CTRL_SIMPLE_EN << MXC_F_SPIXFC_GEN_CTRL_SIMPLE_POS) /**< GEN_CTRL_SIMPLE_EN Setting */

#define MXC_F_SPIXFC_GEN_CTRL_SIMPLERX_POS             21 /**< GEN_CTRL_SIMPLERX Position */
#define MXC_F_SPIXFC_GEN_CTRL_SIMPLERX                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SIMPLERX_POS)) /**< GEN_CTRL_SIMPLERX Mask */
#define MXC_V_SPIXFC_GEN_CTRL_SIMPLERX_INITSPI         ((uint32_t)0x1UL) /**< GEN_CTRL_SIMPLERX_INITSPI Value */
#define MXC_S_SPIXFC_GEN_CTRL_SIMPLERX_INITSPI         (MXC_V_SPIXFC_GEN_CTRL_SIMPLERX_INITSPI << MXC_F_SPIXFC_GEN_CTRL_SIMPLERX_POS) /**< GEN_CTRL_SIMPLERX_INITSPI Setting */

#define MXC_F_SPIXFC_GEN_CTRL_SMPLSS_POS               22 /**< GEN_CTRL_SMPLSS Position */
#define MXC_F_SPIXFC_GEN_CTRL_SMPLSS                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SMPLSS_POS)) /**< GEN_CTRL_SMPLSS Mask */
#define MXC_V_SPIXFC_GEN_CTRL_SMPLSS_DEASSERTSS        ((uint32_t)0x1UL) /**< GEN_CTRL_SMPLSS_DEASSERTSS Value */
#define MXC_S_SPIXFC_GEN_CTRL_SMPLSS_DEASSERTSS        (MXC_V_SPIXFC_GEN_CTRL_SMPLSS_DEASSERTSS << MXC_F_SPIXFC_GEN_CTRL_SMPLSS_POS) /**< GEN_CTRL_SMPLSS_DEASSERTSS Setting */

#define MXC_F_SPIXFC_GEN_CTRL_SCKFB_POS                24 /**< GEN_CTRL_SCKFB Position */
#define MXC_F_SPIXFC_GEN_CTRL_SCKFB                    ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SCKFB_POS)) /**< GEN_CTRL_SCKFB Mask */
#define MXC_V_SPIXFC_GEN_CTRL_SCKFB_DIS                ((uint32_t)0x0UL) /**< GEN_CTRL_SCKFB_DIS Value */
#define MXC_S_SPIXFC_GEN_CTRL_SCKFB_DIS                (MXC_V_SPIXFC_GEN_CTRL_SCKFB_DIS << MXC_F_SPIXFC_GEN_CTRL_SCKFB_POS) /**< GEN_CTRL_SCKFB_DIS Setting */
#define MXC_V_SPIXFC_GEN_CTRL_SCKFB_EN                 ((uint32_t)0x1UL) /**< GEN_CTRL_SCKFB_EN Value */
#define MXC_S_SPIXFC_GEN_CTRL_SCKFB_EN                 (MXC_V_SPIXFC_GEN_CTRL_SCKFB_EN << MXC_F_SPIXFC_GEN_CTRL_SCKFB_POS) /**< GEN_CTRL_SCKFB_EN Setting */

#define MXC_F_SPIXFC_GEN_CTRL_SCKFBINV_POS             25 /**< GEN_CTRL_SCKFBINV Position */
#define MXC_F_SPIXFC_GEN_CTRL_SCKFBINV                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_GEN_CTRL_SCKFBINV_POS)) /**< GEN_CTRL_SCKFBINV Mask */
#define MXC_V_SPIXFC_GEN_CTRL_SCKFBINV_NORMAL          ((uint32_t)0x0UL) /**< GEN_CTRL_SCKFBINV_NORMAL Value */
#define MXC_S_SPIXFC_GEN_CTRL_SCKFBINV_NORMAL          (MXC_V_SPIXFC_GEN_CTRL_SCKFBINV_NORMAL << MXC_F_SPIXFC_GEN_CTRL_SCKFBINV_POS) /**< GEN_CTRL_SCKFBINV_NORMAL Setting */
#define MXC_V_SPIXFC_GEN_CTRL_SCKFBINV_INVERT          ((uint32_t)0x1UL) /**< GEN_CTRL_SCKFBINV_INVERT Value */
#define MXC_S_SPIXFC_GEN_CTRL_SCKFBINV_INVERT          (MXC_V_SPIXFC_GEN_CTRL_SCKFBINV_INVERT << MXC_F_SPIXFC_GEN_CTRL_SCKFBINV_POS) /**< GEN_CTRL_SCKFBINV_INVERT Setting */

/**@} end of group SPIXFC_GEN_CTRL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_FIFO_CTRL SPIXFC_FIFO_CTRL
 * @brief    SPIX Controller FIFO Control and Status Register.
 * @{
 */
#define MXC_F_SPIXFC_FIFO_CTRL_TFIFOLVL_POS            0 /**< FIFO_CTRL_TFIFOLVL Position */
#define MXC_F_SPIXFC_FIFO_CTRL_TFIFOLVL                ((uint32_t)(0xFUL << MXC_F_SPIXFC_FIFO_CTRL_TFIFOLVL_POS)) /**< FIFO_CTRL_TFIFOLVL Mask */

#define MXC_F_SPIXFC_FIFO_CTRL_TFIFOCNT_POS            8 /**< FIFO_CTRL_TFIFOCNT Position */
#define MXC_F_SPIXFC_FIFO_CTRL_TFIFOCNT                ((uint32_t)(0x1FUL << MXC_F_SPIXFC_FIFO_CTRL_TFIFOCNT_POS)) /**< FIFO_CTRL_TFIFOCNT Mask */

#define MXC_F_SPIXFC_FIFO_CTRL_RFIFOLVL_POS            16 /**< FIFO_CTRL_RFIFOLVL Position */
#define MXC_F_SPIXFC_FIFO_CTRL_RFIFOLVL                ((uint32_t)(0x1FUL << MXC_F_SPIXFC_FIFO_CTRL_RFIFOLVL_POS)) /**< FIFO_CTRL_RFIFOLVL Mask */

#define MXC_F_SPIXFC_FIFO_CTRL_RFIFOCNT_POS            24 /**< FIFO_CTRL_RFIFOCNT Position */
#define MXC_F_SPIXFC_FIFO_CTRL_RFIFOCNT                ((uint32_t)(0x3FUL << MXC_F_SPIXFC_FIFO_CTRL_RFIFOCNT_POS)) /**< FIFO_CTRL_RFIFOCNT Mask */

/**@} end of group SPIXFC_FIFO_CTRL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_SP_CTRL SPIXFC_SP_CTRL
 * @brief    SPIX Controller Special Control Register.
 * @{
 */
#define MXC_F_SPIXFC_SP_CTRL_SAMPL_POS                 0 /**< SP_CTRL_SAMPL Position */
#define MXC_F_SPIXFC_SP_CTRL_SAMPL                     ((uint32_t)(0x1UL << MXC_F_SPIXFC_SP_CTRL_SAMPL_POS)) /**< SP_CTRL_SAMPL Mask */
#define MXC_V_SPIXFC_SP_CTRL_SAMPL_DIS                 ((uint32_t)0x0UL) /**< SP_CTRL_SAMPL_DIS Value */
#define MXC_S_SPIXFC_SP_CTRL_SAMPL_DIS                 (MXC_V_SPIXFC_SP_CTRL_SAMPL_DIS << MXC_F_SPIXFC_SP_CTRL_SAMPL_POS) /**< SP_CTRL_SAMPL_DIS Setting */
#define MXC_V_SPIXFC_SP_CTRL_SAMPL_EN                  ((uint32_t)0x1UL) /**< SP_CTRL_SAMPL_EN Value */
#define MXC_S_SPIXFC_SP_CTRL_SAMPL_EN                  (MXC_V_SPIXFC_SP_CTRL_SAMPL_EN << MXC_F_SPIXFC_SP_CTRL_SAMPL_POS) /**< SP_CTRL_SAMPL_EN Setting */

