analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/spixfc_regs.h
#define MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_POS              4 /**< SP_CTRL_SDIO_OUT Position */
#define MXC_F_SPIXFC_SP_CTRL_SDIO_OUT                  ((uint32_t)(0xFUL << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_POS)) /**< SP_CTRL_SDIO_OUT Mask */
#define MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_SDIO0            ((uint32_t)0x1UL) /**< SP_CTRL_SDIO_OUT_SDIO0 Value */
#define MXC_S_SPIXFC_SP_CTRL_SDIO_OUT_SDIO0            (MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_SDIO0 << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_POS) /**< SP_CTRL_SDIO_OUT_SDIO0 Setting */
#define MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_SDIO1            ((uint32_t)0x2UL) /**< SP_CTRL_SDIO_OUT_SDIO1 Value */
#define MXC_S_SPIXFC_SP_CTRL_SDIO_OUT_SDIO1            (MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_SDIO1 << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_POS) /**< SP_CTRL_SDIO_OUT_SDIO1 Setting */
#define MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_SDIO2            ((uint32_t)0x4UL) /**< SP_CTRL_SDIO_OUT_SDIO2 Value */
#define MXC_S_SPIXFC_SP_CTRL_SDIO_OUT_SDIO2            (MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_SDIO2 << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_POS) /**< SP_CTRL_SDIO_OUT_SDIO2 Setting */
#define MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_SDIO3            ((uint32_t)0x8UL) /**< SP_CTRL_SDIO_OUT_SDIO3 Value */
#define MXC_S_SPIXFC_SP_CTRL_SDIO_OUT_SDIO3            (MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_SDIO3 << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_POS) /**< SP_CTRL_SDIO_OUT_SDIO3 Setting */

#define MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_EN_POS           8 /**< SP_CTRL_SDIO_OUT_EN Position */
#define MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_EN               ((uint32_t)(0xFUL << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_EN_POS)) /**< SP_CTRL_SDIO_OUT_EN Mask */
#define MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO0         ((uint32_t)0x1UL) /**< SP_CTRL_SDIO_OUT_EN_SDIO0 Value */
#define MXC_S_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO0         (MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO0 << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_EN_POS) /**< SP_CTRL_SDIO_OUT_EN_SDIO0 Setting */
#define MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO1         ((uint32_t)0x2UL) /**< SP_CTRL_SDIO_OUT_EN_SDIO1 Value */
#define MXC_S_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO1         (MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO1 << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_EN_POS) /**< SP_CTRL_SDIO_OUT_EN_SDIO1 Setting */
#define MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO2         ((uint32_t)0x4UL) /**< SP_CTRL_SDIO_OUT_EN_SDIO2 Value */
#define MXC_S_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO2         (MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO2 << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_EN_POS) /**< SP_CTRL_SDIO_OUT_EN_SDIO2 Setting */
#define MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO3         ((uint32_t)0x8UL) /**< SP_CTRL_SDIO_OUT_EN_SDIO3 Value */
#define MXC_S_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO3         (MXC_V_SPIXFC_SP_CTRL_SDIO_OUT_EN_SDIO3 << MXC_F_SPIXFC_SP_CTRL_SDIO_OUT_EN_POS) /**< SP_CTRL_SDIO_OUT_EN_SDIO3 Setting */

#define MXC_F_SPIXFC_SP_CTRL_SCKINH3_POS               16 /**< SP_CTRL_SCKINH3 Position */
#define MXC_F_SPIXFC_SP_CTRL_SCKINH3                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_SP_CTRL_SCKINH3_POS)) /**< SP_CTRL_SCKINH3 Mask */
#define MXC_V_SPIXFC_SP_CTRL_SCKINH3_EN                ((uint32_t)0x0UL) /**< SP_CTRL_SCKINH3_EN Value */
#define MXC_S_SPIXFC_SP_CTRL_SCKINH3_EN                (MXC_V_SPIXFC_SP_CTRL_SCKINH3_EN << MXC_F_SPIXFC_SP_CTRL_SCKINH3_POS) /**< SP_CTRL_SCKINH3_EN Setting */
#define MXC_V_SPIXFC_SP_CTRL_SCKINH3_DIS               ((uint32_t)0x1UL) /**< SP_CTRL_SCKINH3_DIS Value */
#define MXC_S_SPIXFC_SP_CTRL_SCKINH3_DIS               (MXC_V_SPIXFC_SP_CTRL_SCKINH3_DIS << MXC_F_SPIXFC_SP_CTRL_SCKINH3_POS) /**< SP_CTRL_SCKINH3_DIS Setting */

/**@} end of group SPIXFC_SP_CTRL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_INT_FL SPIXFC_INT_FL
 * @brief    SPIX Controller Interrupt Status Register.
 * @{
 */
#define MXC_F_SPIXFC_INT_FL_TSTALL_POS                 0 /**< INT_FL_TSTALL Position */
#define MXC_F_SPIXFC_INT_FL_TSTALL                     ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_TSTALL_POS)) /**< INT_FL_TSTALL Mask */
#define MXC_V_SPIXFC_INT_FL_TSTALL_CLEAR               ((uint32_t)0x1UL) /**< INT_FL_TSTALL_CLEAR Value */
#define MXC_S_SPIXFC_INT_FL_TSTALL_CLEAR               (MXC_V_SPIXFC_INT_FL_TSTALL_CLEAR << MXC_F_SPIXFC_INT_FL_TSTALL_POS) /**< INT_FL_TSTALL_CLEAR Setting */

#define MXC_F_SPIXFC_INT_FL_RSTALL_POS                 1 /**< INT_FL_RSTALL Position */
#define MXC_F_SPIXFC_INT_FL_RSTALL                     ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_RSTALL_POS)) /**< INT_FL_RSTALL Mask */
#define MXC_V_SPIXFC_INT_FL_RSTALL_CLEAR               ((uint32_t)0x1UL) /**< INT_FL_RSTALL_CLEAR Value */
#define MXC_S_SPIXFC_INT_FL_RSTALL_CLEAR               (MXC_V_SPIXFC_INT_FL_RSTALL_CLEAR << MXC_F_SPIXFC_INT_FL_RSTALL_POS) /**< INT_FL_RSTALL_CLEAR Setting */

#define MXC_F_SPIXFC_INT_FL_TRDY_POS                   2 /**< INT_FL_TRDY Position */
#define MXC_F_SPIXFC_INT_FL_TRDY                       ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_TRDY_POS)) /**< INT_FL_TRDY Mask */
#define MXC_V_SPIXFC_INT_FL_TRDY_CLEAR                 ((uint32_t)0x1UL) /**< INT_FL_TRDY_CLEAR Value */
#define MXC_S_SPIXFC_INT_FL_TRDY_CLEAR                 (MXC_V_SPIXFC_INT_FL_TRDY_CLEAR << MXC_F_SPIXFC_INT_FL_TRDY_POS) /**< INT_FL_TRDY_CLEAR Setting */

#define MXC_F_SPIXFC_INT_FL_RDONE_POS                  3 /**< INT_FL_RDONE Position */
#define MXC_F_SPIXFC_INT_FL_RDONE                      ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_RDONE_POS)) /**< INT_FL_RDONE Mask */
#define MXC_V_SPIXFC_INT_FL_RDONE_CLEAR                ((uint32_t)0x1UL) /**< INT_FL_RDONE_CLEAR Value */
#define MXC_S_SPIXFC_INT_FL_RDONE_CLEAR                (MXC_V_SPIXFC_INT_FL_RDONE_CLEAR << MXC_F_SPIXFC_INT_FL_RDONE_POS) /**< INT_FL_RDONE_CLEAR Setting */

#define MXC_F_SPIXFC_INT_FL_TFIFOAE_POS                4 /**< INT_FL_TFIFOAE Position */
#define MXC_F_SPIXFC_INT_FL_TFIFOAE                    ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_TFIFOAE_POS)) /**< INT_FL_TFIFOAE Mask */
#define MXC_V_SPIXFC_INT_FL_TFIFOAE_CLEAR              ((uint32_t)0x1UL) /**< INT_FL_TFIFOAE_CLEAR Value */
#define MXC_S_SPIXFC_INT_FL_TFIFOAE_CLEAR              (MXC_V_SPIXFC_INT_FL_TFIFOAE_CLEAR << MXC_F_SPIXFC_INT_FL_TFIFOAE_POS) /**< INT_FL_TFIFOAE_CLEAR Setting */

#define MXC_F_SPIXFC_INT_FL_RFIFOAF_POS                5 /**< INT_FL_RFIFOAF Position */
#define MXC_F_SPIXFC_INT_FL_RFIFOAF                    ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_FL_RFIFOAF_POS)) /**< INT_FL_RFIFOAF Mask */
#define MXC_V_SPIXFC_INT_FL_RFIFOAF_CLEAR              ((uint32_t)0x1UL) /**< INT_FL_RFIFOAF_CLEAR Value */
#define MXC_S_SPIXFC_INT_FL_RFIFOAF_CLEAR              (MXC_V_SPIXFC_INT_FL_RFIFOAF_CLEAR << MXC_F_SPIXFC_INT_FL_RFIFOAF_POS) /**< INT_FL_RFIFOAF_CLEAR Setting */

/**@} end of group SPIXFC_INT_FL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_INT_EN SPIXFC_INT_EN
 * @brief    SPIX Controller Interrupt Enable Register.
 * @{
 */
#define MXC_F_SPIXFC_INT_EN_TSTALLIE_POS               0 /**< INT_EN_TSTALLIE Position */
#define MXC_F_SPIXFC_INT_EN_TSTALLIE                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_TSTALLIE_POS)) /**< INT_EN_TSTALLIE Mask */
#define MXC_V_SPIXFC_INT_EN_TSTALLIE_DIS               ((uint32_t)0x0UL) /**< INT_EN_TSTALLIE_DIS Value */
#define MXC_S_SPIXFC_INT_EN_TSTALLIE_DIS               (MXC_V_SPIXFC_INT_EN_TSTALLIE_DIS << MXC_F_SPIXFC_INT_EN_TSTALLIE_POS) /**< INT_EN_TSTALLIE_DIS Setting */
#define MXC_V_SPIXFC_INT_EN_TSTALLIE_EN                ((uint32_t)0x1UL) /**< INT_EN_TSTALLIE_EN Value */
#define MXC_S_SPIXFC_INT_EN_TSTALLIE_EN                (MXC_V_SPIXFC_INT_EN_TSTALLIE_EN << MXC_F_SPIXFC_INT_EN_TSTALLIE_POS) /**< INT_EN_TSTALLIE_EN Setting */

#define MXC_F_SPIXFC_INT_EN_RSTALLIE_POS               1 /**< INT_EN_RSTALLIE Position */
#define MXC_F_SPIXFC_INT_EN_RSTALLIE                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_RSTALLIE_POS)) /**< INT_EN_RSTALLIE Mask */
#define MXC_V_SPIXFC_INT_EN_RSTALLIE_DIS               ((uint32_t)0x0UL) /**< INT_EN_RSTALLIE_DIS Value */
#define MXC_S_SPIXFC_INT_EN_RSTALLIE_DIS               (MXC_V_SPIXFC_INT_EN_RSTALLIE_DIS << MXC_F_SPIXFC_INT_EN_RSTALLIE_POS) /**< INT_EN_RSTALLIE_DIS Setting */
#define MXC_V_SPIXFC_INT_EN_RSTALLIE_EN                ((uint32_t)0x1UL) /**< INT_EN_RSTALLIE_EN Value */
#define MXC_S_SPIXFC_INT_EN_RSTALLIE_EN                (MXC_V_SPIXFC_INT_EN_RSTALLIE_EN << MXC_F_SPIXFC_INT_EN_RSTALLIE_POS) /**< INT_EN_RSTALLIE_EN Setting */

#define MXC_F_SPIXFC_INT_EN_TRDYIE_POS                 2 /**< INT_EN_TRDYIE Position */
#define MXC_F_SPIXFC_INT_EN_TRDYIE                     ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_TRDYIE_POS)) /**< INT_EN_TRDYIE Mask */
#define MXC_V_SPIXFC_INT_EN_TRDYIE_DIS                 ((uint32_t)0x0UL) /**< INT_EN_TRDYIE_DIS Value */
#define MXC_S_SPIXFC_INT_EN_TRDYIE_DIS                 (MXC_V_SPIXFC_INT_EN_TRDYIE_DIS << MXC_F_SPIXFC_INT_EN_TRDYIE_POS) /**< INT_EN_TRDYIE_DIS Setting */
#define MXC_V_SPIXFC_INT_EN_TRDYIE_EN                  ((uint32_t)0x1UL) /**< INT_EN_TRDYIE_EN Value */
#define MXC_S_SPIXFC_INT_EN_TRDYIE_EN                  (MXC_V_SPIXFC_INT_EN_TRDYIE_EN << MXC_F_SPIXFC_INT_EN_TRDYIE_POS) /**< INT_EN_TRDYIE_EN Setting */

#define MXC_F_SPIXFC_INT_EN_RDONEIE_POS                3 /**< INT_EN_RDONEIE Position */
#define MXC_F_SPIXFC_INT_EN_RDONEIE                    ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_RDONEIE_POS)) /**< INT_EN_RDONEIE Mask */
#define MXC_V_SPIXFC_INT_EN_RDONEIE_DIS                ((uint32_t)0x0UL) /**< INT_EN_RDONEIE_DIS Value */
#define MXC_S_SPIXFC_INT_EN_RDONEIE_DIS                (MXC_V_SPIXFC_INT_EN_RDONEIE_DIS << MXC_F_SPIXFC_INT_EN_RDONEIE_POS) /**< INT_EN_RDONEIE_DIS Setting */
#define MXC_V_SPIXFC_INT_EN_RDONEIE_EN                 ((uint32_t)0x1UL) /**< INT_EN_RDONEIE_EN Value */
#define MXC_S_SPIXFC_INT_EN_RDONEIE_EN                 (MXC_V_SPIXFC_INT_EN_RDONEIE_EN << MXC_F_SPIXFC_INT_EN_RDONEIE_POS) /**< INT_EN_RDONEIE_EN Setting */

#define MXC_F_SPIXFC_INT_EN_TFIFOAEIE_POS              4 /**< INT_EN_TFIFOAEIE Position */
#define MXC_F_SPIXFC_INT_EN_TFIFOAEIE                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_TFIFOAEIE_POS)) /**< INT_EN_TFIFOAEIE Mask */
#define MXC_V_SPIXFC_INT_EN_TFIFOAEIE_DIS              ((uint32_t)0x0UL) /**< INT_EN_TFIFOAEIE_DIS Value */
#define MXC_S_SPIXFC_INT_EN_TFIFOAEIE_DIS              (MXC_V_SPIXFC_INT_EN_TFIFOAEIE_DIS << MXC_F_SPIXFC_INT_EN_TFIFOAEIE_POS) /**< INT_EN_TFIFOAEIE_DIS Setting */
#define MXC_V_SPIXFC_INT_EN_TFIFOAEIE_EN               ((uint32_t)0x1UL) /**< INT_EN_TFIFOAEIE_EN Value */
#define MXC_S_SPIXFC_INT_EN_TFIFOAEIE_EN               (MXC_V_SPIXFC_INT_EN_TFIFOAEIE_EN << MXC_F_SPIXFC_INT_EN_TFIFOAEIE_POS) /**< INT_EN_TFIFOAEIE_EN Setting */

#define MXC_F_SPIXFC_INT_EN_RFIFOAFIE_POS              5 /**< INT_EN_RFIFOAFIE Position */
#define MXC_F_SPIXFC_INT_EN_RFIFOAFIE                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INT_EN_RFIFOAFIE_POS)) /**< INT_EN_RFIFOAFIE Mask */
#define MXC_V_SPIXFC_INT_EN_RFIFOAFIE_DIS              ((uint32_t)0x0UL) /**< INT_EN_RFIFOAFIE_DIS Value */
#define MXC_S_SPIXFC_INT_EN_RFIFOAFIE_DIS              (MXC_V_SPIXFC_INT_EN_RFIFOAFIE_DIS << MXC_F_SPIXFC_INT_EN_RFIFOAFIE_POS) /**< INT_EN_RFIFOAFIE_DIS Setting */
#define MXC_V_SPIXFC_INT_EN_RFIFOAFIE_EN               ((uint32_t)0x1UL) /**< INT_EN_RFIFOAFIE_EN Value */
#define MXC_S_SPIXFC_INT_EN_RFIFOAFIE_EN               (MXC_V_SPIXFC_INT_EN_RFIFOAFIE_EN << MXC_F_SPIXFC_INT_EN_RFIFOAFIE_POS) /**< INT_EN_RFIFOAFIE_EN Setting */

/**@} end of group SPIXFC_INT_EN_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_SPIXFC_REGS_H_
